[
  {
    "name": "React",
    "id": "react",
    "description": "currently the most popular front-end JavaScript framework along with Vue and Angular",
    "resources": [
      {
        "name": "Examples of consuming APIs with fetch and axios",
        "id": "506",
        "description":
          "This code shows how to load data from APIs using both the standard fetch() as well as the library axios()."
      },
      {
        "name": "Create a reusable todolist component in React that uses localStorage",
        "id": "504",
        "description":
          "This sample app shows a number of concepts: (1) how to create components that are 100% separate from each other, you can create as many todolist components as you want, (2) how to use useRef to programmatically set focus in a field, (3) how to use localStorage to save todo-list data in the user's browser, and (4) how to use radio buttons in React."
      },
      {
        "name": "How to pass and change state variables via props",
        "id": "498",
        "description":
          "This project shows how to a state variable (here: an array of passenger object) down multiple levels of components, via props, allowing the components to chance the original state variable in the highest component."
      }
    ]
  },
  {
    "name": "JavaScript",
    "id": "javascript",
    "description": "the main scripting language of the Web",
    "resources": [
      {
        "name": "How to attach JavaScript class methods as event handlers",
        "id": "490",
        "description":
          "This example demonstrates how to create class methods that can be used as event handlers, e.g. for vanilla JavaScript sites."
      },
      {
        "name": "Create a cashier calculator to return change",
        "id": "481",
        "description":
          "This is a solution to a JavaScript exercise create a function that simulates what a cashier has to do when a customer has a certain amount to pay, pays more than the amount, and the cashier has to calculate the change."
      }
    ]
  },
  {
    "name": "GraphQL",
    "id": "graphql",
    "description": "a newer and more robust alternative to REST",
    "resources": [
      {
        "name": "How to set up a GraphQL backend with MongoDB and Express",
        "id": "507",
        "description":
          "The project shows you how to setup a GraphQL server locally with Apollo and Express which serves data from a MongoDB database."
      },
      {
        "name": "Build a two-page website with Gatsby and host at Netlify",
        "id": "478",
        "description":
          "These instructions will show you how to get a Gatsby website up and running witih GraphQL."
      }
    ]
  }
]